"""
Составить программу вывода на экран вещественного числа, вводимого с клавиатуры.
Выводимому числу должно предшествовать сообщение "Вы ввели число" (без кавычек).
"""
a = float(input())
print(f"Вы ввели число {a}")
