"""
На вход программе подается строка.
Прочитайте эту строку и отобразите на экране ее первый и последний символ (подряд в одну строчку).
"""
s = input()
print(s[0] + s[-1])
