"""
На вход программе подается строка. Прочитайте эту строку и отобразите последние три ее символа.
Полагается, что строка гарантированно имеет длину не менее трех символов.
"""
s = input()
print(s[:4])
