"""
На вход программе подается слово в виде строки. Необходимо прочитать это слово и его первую букву сделать заглавной,
а остальные - малыми. Результат отобразить на экране.
"""
print(input().lower().capitalize())
